# 2. DATA UNDERSTANDING

----

### IMPORTING THE NECESSARY LIBRARIES

In [43]:
import pandas as pd 
import numpy as np

#### LOADING DATASETS

In [44]:
inflation_data = pd.read_csv('Inflation Rates.csv')

In [45]:
commodity_data = pd.read_excel('commodity prices.xlsx')

In [46]:
annual_gdp_data = pd.read_csv('Annual GDP.csv')

In [47]:
forex_data = pd.read_csv("Key CBK Indicative Exchange Rates.csv")

#### DATA DESCRIPTION

#### 1. Commodities data

In [48]:
commodity_data.head(15)

,date,price of bread (400g),Refined Vegetable oil (1L),"Cows Milk(Fresh,Pasteurized) -500ML",Diesel (1L),Maize meal(2kg),Gasoline (1L)
0,2005-01-31,25.0,98.0,23.0,58.39,NaN,69.49
1,2005-02-28,25.0,105.0,24.0,57.79,NaN,68.89
2,2005-03-31,25.0,105.0,24.0,57.39,NaN,68.49
3,2005-04-30,25.0,105.0,26.0,61.99,NaN,71.99
4,2005-05-31,27.0,110.0,26.0,61.99,NaN,71.99
5,2005-06-30,25.0,98.0,22.0,62.99,NaN,72.99
6,2005-07-31,25.0,110.0,20.0,62.49,NaN,72.49
7,2005-08-31,25.0,105.0,20.0,64.99,NaN,74.99
8,2005-09-30,25.0,105.0,20.0,65.99,NaN,76.99
9,2005-10-31,25.0,105.0,20.0,64.99,NaN,75.99
10,2005-11-30,25.0,105.0,20.0,64.99,NaN,74.99
11,2005-12-31,25.0,110.0,20.0,64.99,NaN,74.99
12,2006-01-31,26.0,115.0,22.0,65.99,50.693333,75.99
13,2006-02-28,26.0,120.0,25.0,64.99,52.573333,74.99
14,2006-03-31,26.0,108.0,25.0,65.99,52.480000,75.99

In [49]:
commodity_data.tail()

,date,price of bread (400g),Refined Vegetable oil (1L),"Cows Milk(Fresh,Pasteurized) -500ML",Diesel (1L),Maize meal(2kg),Gasoline (1L)
214,2022-11-30,60.0,599.0,55.0,162.0,211.0,177.3
215,2022-12-31,60.0,599.0,60.0,162.0,202.0,177.3
216,2023-01-31,60.0,599.0,53.0,162.0,185.0,177.3
217,2023-02-28,NaN,NaN,NaN,NaN,NaN,NaN
218,2023-03-31,NaN,NaN,NaN,NaN,NaN,NaN

In [50]:
commodity_data.shape

(219, 7)

In [51]:
commodity_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 219 entries, 0 to 218
Data columns (total 7 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   date                                 219 non-null    datetime64[ns]
 1   price of bread (400g)                213 non-null    float64
 2   Refined Vegetable oil (1L)           213 non-null    float64
 3   Cows Milk(Fresh,Pasteurized) -500ML  213 non-null    float64
 4    Diesel (1L)                         213 non-null    float64
 5   Maize meal(2kg)                      199 non-null    float64
 6   Gasoline (1L)                        213 non-null    float64
dtypes: datetime64[ns](1), float64(6)
memory usage: 12.1 KB

In [52]:
commodity_data.describe()

,price of bread (400g),Refined Vegetable oil (1L),"Cows Milk(Fresh,Pasteurized) -500ML",Diesel (1L),Maize meal(2kg),Gasoline (1L)
count,213.00000,213.000000,213.000000,213.000000,199.000000,213.000000
mean,42.41784,242.117371,38.924883,92.247230,99.665745,102.494413
std,9.89230,107.978948,11.937494,20.176162,33.039653,21.289834
min,25.00000,98.000000,20.000000,57.390000,12.000000,68.490000
25%,34.00000,154.000000,27.000000,76.700000,83.000000,85.990000
50%,46.00000,230.000000,45.000000,91.990000,103.000000,102.440000
75%,50.00000,305.000000,49.000000,104.730000,115.000000,113.500000
max,63.00000,622.000000,60.000000,165.000000,211.000000,179.300000

#### 2. Inflation data

In [53]:
inflation_data.head()

   Year     Month  Annual Average Inflation  12-Month Inflation
0  2023  February                      8.30                9.23
1  2023   January                      7.95                8.98
2  2022  December                      7.66                9.06
3  2022  November                      7.38                9.48
4  2022   October                      7.48                9.59

In [54]:
inflation_data.tail()

     Year     Month  Annual Average Inflation  12-Month Inflation
214  2005       May                     14.61               14.78
215  2005     April                     13.76               16.02
216  2005     March                     13.07               14.15
217  2005  February                     12.60               13.94
218  2005   January                     12.27               14.87

In [55]:
inflation_data.shape

(219, 4)

In [56]:
inflation_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 219 entries, 0 to 218
Data columns (total 4 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Year                      219 non-null    int64
 1   Month                     219 non-null    object
 2   Annual Average Inflation  219 non-null    float64
 3   12-Month Inflation        219 non-null    float64
dtypes: float64(2), int64(1), object(1)
memory usage: 7.0+ KB

In [57]:
inflation_data.describe()

              Year  Annual Average Inflation  12-Month Inflation
count   219.000000                219.000000          219.000000
mean   2013.611872                  7.701872            7.584155
std       5.255844                  3.418770            4.048050
min    2005.000000                  3.930000            1.850000
25%    2009.000000                  5.395000            5.000000
50%    2014.000000                  6.440000            6.340000
75%    2018.000000                  8.345000            8.485000
max    2023.000000                 17.070000           19.720000

#### 3. Annual GDP

In [58]:
annual_gdp_data.head()

,Year,Nominal GDP prices (Ksh Million),Annual GDP growth (%),Real GDP prices (Ksh Million)
0,2021,"12,098,200",7.5,"9,391,684"
1,2020,"10,716,034",-0.3,"8,735,040"
2,2019,"10,237,727",5.1,"8,756,946"
3,2018,"9,340,307",5.6,"8,330,891"
4,2017,"8,483,396",3.8,"7,885,521"

In [59]:
annual_gdp_data.tail()

,Year,Nominal GDP prices (Ksh Million),Annual GDP growth (%),Real GDP prices (Ksh Million)
18,2003,"1,131,783",2.9,"1,055,658"
19,2002,"1,035,374",0.5,"1,025,583"
20,2001,"1,020,022",3.8,"1,020,111"
21,2000,"967,838",0.0,"982,855"
22,0,0,0.0,0

In [60]:
annual_gdp_data.shape

(23, 4)

In [61]:
annual_gdp_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23 entries, 0 to 22
Data columns (total 4 columns):
 #   Column                            Non-Null Count  Dtype
---  ------                            --------------  -----
 0   Year                              23 non-null     int64
 1   Nominal GDP prices (Ksh Million)  23 non-null     object
 2   Annual GDP growth (%)             23 non-null     float64
 3   Real GDP prices (Ksh Million)     23 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 864.0+ bytes

In [62]:
annual_gdp_data.describe()

              Year  Annual GDP growth (%)
count    23.000000              23.000000
mean   1923.086957               4.047826
std     419.266233               2.404138
min       0.000000              -0.300000
25%    2004.500000               2.800000
50%    2010.000000               4.600000
75%    2015.500000               5.350000
max    2021.000000               8.100000

#### 4. Forex data

In [63]:
forex_data.head()

         Date    Currency      Mean       Buy      Sell
0  29/03/2023   JPY (100)  100.6427  100.5624  100.7229
1  29/03/2023   IND RUPEE    1.6035    1.6017    1.6052
2  29/03/2023  NOR KRONER   12.6534   12.6419   12.6650
3  29/03/2023   AE DIRHAM   35.8829   35.8508   35.9150
4  29/03/2023   SW KRONER   12.7334   12.7221   12.7448

In [64]:
forex_data.tail()

            Date      Currency     Mean      Buy     Sell
5995  03/02/2022  AUSTRALIAN $  80.8963  80.8024  80.9902
5996  03/02/2022     KES / RWF   9.1469   9.0416   9.2522
5997  03/02/2022     AE DIRHAM  30.9243  30.8933  30.9553
5998  03/02/2022   SAUDI RIYAL  30.2760  30.2485  30.3035
5999  03/02/2022     SW KRONER  12.3393  12.3248  12.3539

In [65]:
forex_data.shape

(6000, 5)

In [66]:
forex_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6000 entries, 0 to 5999
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      6000 non-null   object
 1   Currency  6000 non-null   object
 2   Mean      6000 non-null   float64
 3   Buy       6000 non-null   float64
 4   Sell      6000 non-null   float64
dtypes: float64(3), object(2)
memory usage: 234.5+ KB

In [67]:
forex_data.describe()

              Mean          Buy         Sell
count  6000.000000  6000.000000  6000.000000
mean     52.209088    52.139341    52.278835
std      47.334708    47.303542    47.365954
min       1.459200     1.457900     1.460500
25%      14.842850    14.830150    14.855625
50%      30.665500    30.619050    30.715100
75%      91.068200    90.983450    91.153450
max     162.220300   162.072400   162.368200

# 3. DATA PREPARATION

---

In [68]:
### Dealing with missing values 

commodity_data.isna().sum()

date                                    0
price of bread (400g)                   6
Refined Vegetable oil (1L)              6
Cows Milk(Fresh,Pasteurized) -500ML     6
 Diesel (1L)                            6
Maize meal(2kg)                        20
Gasoline (1L)                           6
dtype: int64

In [69]:
# Price of bread 

bread_data = commodity_data['date','price of bread (400g)']

KeyError: ('date', 'price of bread (400g)')